<template>
    <div>
        <div class="mt-4 box">
                <Owl :item="[3,4,6]" id="slider" v-if="sliders.length >0">
                    <div class="item relative group" v-for="slider in sliders" :key="slider.id">
                        <router-link :to="{path:`/detail/${slider.movie.slug}`}">
                            <img class="h-[19rem] fm:h-[11rem] rounded-lg" :src="url+slider.movie.image" />
                            <figure class="absolute z-50 top-0 right-0 w-full cursor-pointer h-0 group group-hover:h-full ease-in duration-300 rounded-lg bg-black opacity-70">
                                <div class="absolute hidden group-hover:block py-2 text-center ease-in duration-300">
                                    <p class="rem--5 text-xs text-yellow-300 rtl">
                                        {{slider.movie.description}}
                                    </p>
                                </div>
                            </figure>
                            <div class="absolute bottom-0 w-full z-50">
                                <div class="flex flex-row w-full gap-2 pt-2 items-center  bg-black opacity-60">
                                    <span class="fm:hidden">
                                        <svg xmlns="http://www.w3.org/2000/svg" version="1.1" width="44" height="18" viewBox="0 0 64 32"><g fill="#e80056"><rect x="0" y="0" width="100%" height="100%" rx="4"></rect></g><g transform="translate(8.000000, 7.000000)" fill="#000000" fill-rule="nonzero"><polygon points="0 18 5 18 5 0 0 0"></polygon><path d="M15.6725178,0 L14.5534833,8.40846934 L13.8582008,3.83502426 C13.65661,2.37009263 13.4632474,1.09175121 13.278113,0 L7,0 L7,18 L11.2416347,18 L11.2580911,6.11380679 L13.0436094,18 L16.0633571,18 L17.7583653,5.8517865 L17.7707076,18 L22,18 L22,0 L15.6725178,0 Z"></path><path d="M24,18 L24,0 L31.8045586,0 C33.5693522,0 35,1.41994415 35,3.17660424 L35,14.8233958 C35,16.5777858 33.5716617,18 31.8045586,18 L24,18 Z M29.8322479,3.2395236 C29.6339219,3.13233348 29.2545158,3.08072342 28.7026524,3.08072342 L28.7026524,14.8914865 C29.4312846,14.8914865 29.8796736,14.7604764 30.0478195,14.4865461 C30.2159654,14.2165858 30.3021941,13.486105 30.3021941,12.2871637 L30.3021941,5.3078959 C30.3021941,4.49404499 30.272014,3.97397442 30.2159654,3.74371416 C30.1599168,3.5134539 30.0348852,3.34671372 29.8322479,3.2395236 Z"></path><path d="M44.4299079,4.50685823 L44.749518,4.50685823 C46.5447098,4.50685823 48,5.91267586 48,7.64486762 L48,14.8619906 C48,16.5950653 46.5451816,18 44.749518,18 L44.4299079,18 C43.3314617,18 42.3602746,17.4736618 41.7718697,16.6682739 L41.4838962,17.7687785 L37,17.7687785 L37,0 L41.7843263,0 L41.7843263,5.78053556 C42.4024982,5.01015739 43.3551514,4.50685823 44.4299079,4.50685823 Z M43.4055679,13.2842155 L43.4055679,9.01907814 C43.4055679,8.31433946 43.3603268,7.85185468 43.2660746,7.63896485 C43.1718224,7.42607505 42.7955881,7.2893916 42.5316822,7.2893916 C42.267776,7.2893916 41.8607934,7.40047379 41.7816216,7.58767002 L41.7816216,9.01907814 L41.7816216,13.4207851 L41.7816216,14.8074788 C41.8721037,15.0130276 42.2602358,15.1274059 42.5316822,15.1274059 C42.8031285,15.1274059 43.1982131,15.0166981 43.281155,14.8074788 C43.3640968,14.5982595 43.4055679,14.0880581 43.4055679,13.2842155 Z"></path></g></svg>
                                    </span>
                                    <span class="fd:hidden">
                                        <svg xmlns="http://www.w3.org/2000/svg" version="1.1" width="35" height="14" viewBox="0 0 64 32"><g fill="#e80056"><rect x="0" y="0" width="100%" height="100%" rx="4"></rect></g><g transform="translate(8.000000, 7.000000)" fill="#000000" fill-rule="nonzero"><polygon points="0 18 5 18 5 0 0 0"></polygon><path d="M15.6725178,0 L14.5534833,8.40846934 L13.8582008,3.83502426 C13.65661,2.37009263 13.4632474,1.09175121 13.278113,0 L7,0 L7,18 L11.2416347,18 L11.2580911,6.11380679 L13.0436094,18 L16.0633571,18 L17.7583653,5.8517865 L17.7707076,18 L22,18 L22,0 L15.6725178,0 Z"></path><path d="M24,18 L24,0 L31.8045586,0 C33.5693522,0 35,1.41994415 35,3.17660424 L35,14.8233958 C35,16.5777858 33.5716617,18 31.8045586,18 L24,18 Z M29.8322479,3.2395236 C29.6339219,3.13233348 29.2545158,3.08072342 28.7026524,3.08072342 L28.7026524,14.8914865 C29.4312846,14.8914865 29.8796736,14.7604764 30.0478195,14.4865461 C30.2159654,14.2165858 30.3021941,13.486105 30.3021941,12.2871637 L30.3021941,5.3078959 C30.3021941,4.49404499 30.272014,3.97397442 30.2159654,3.74371416 C30.1599168,3.5134539 30.0348852,3.34671372 29.8322479,3.2395236 Z"></path><path d="M44.4299079,4.50685823 L44.749518,4.50685823 C46.5447098,4.50685823 48,5.91267586 48,7.64486762 L48,14.8619906 C48,16.5950653 46.5451816,18 44.749518,18 L44.4299079,18 C43.3314617,18 42.3602746,17.4736618 41.7718697,16.6682739 L41.4838962,17.7687785 L37,17.7687785 L37,0 L41.7843263,0 L41.7843263,5.78053556 C42.4024982,5.01015739 43.3551514,4.50685823 44.4299079,4.50685823 Z M43.4055679,13.2842155 L43.4055679,9.01907814 C43.4055679,8.31433946 43.3603268,7.85185468 43.2660746,7.63896485 C43.1718224,7.42607505 42.7955881,7.2893916 42.5316822,7.2893916 C42.267776,7.2893916 41.8607934,7.40047379 41.7816216,7.58767002 L41.7816216,9.01907814 L41.7816216,13.4207851 L41.7816216,14.8074788 C41.8721037,15.0130276 42.2602358,15.1274059 42.5316822,15.1274059 C42.8031285,15.1274059 43.1982131,15.0166981 43.281155,14.8074788 C43.3640968,14.5982595 43.4055679,14.0880581 43.4055679,13.2842155 Z"></path></g></svg>
                                    </span>
                                    <span class="rem--7 text-gray-200 !font-extrabold">{{slider.movie.imdb_number}}/10</span>
                                </div>
                                <div class="bg-black opacity-60 py-2 w-full text-center">
                                    <span class="rem--7 text-gray-200 !font-extrabold">{{slider.movie.title}}</span>
                                </div>
                            </div>
                        </router-link>
                    </div>
                </Owl>
            </div>
            <div class="box">
                <div class="flex items-start">
                    <div class="flex items-center pl-1">
                        <button @click="genreSwitch = 'movie'" :class="['bg-gray-900 rem--8 rounded-r-full p-2 gap-2', genreSwitch === 'movie' ? '!bg-crimson-200' : '']">فیلم</button>
                        <button @click="genreSwitch = 'serial'" :class="['bg-gray-900 rem--8 rounded-l-full p-2 gap-2', genreSwitch === 'serial' ? '!bg-crimson-200' : '']">سریال</button>
                    </div>
                    <Owl v-if="(Object.values(genres)).length > 0" :item="[3,4,8]" :loop="false" id="genre" >
                        <div class="item" v-for="(index,genre) in genres" :key="index">
                            <div class="rounded-full border border-green-700 text-center p-2" @click="getData(genre)">
                                <span class="rem--7 break-all text-gray-300 hover:text-gray-400">{{genre}}</span>
                            </div>
                        </div>
                    </Owl>
                </div>
            </div>

            <div class="box" >
                <div v-if="movies.length > 0" class="flex flex-wrap gap-3 items-center justify-evenly">
                    <div class="relative group" v-for="movie in movies" :key="movie.id">
                        <router-link :to="{path:`/detail/${movie.slug}`}">
                            <img class="h-[19rem] fm:h-[11rem] rounded-lg" :src="url+movie.image" />
                            <figure class="absolute z-50 bottom-0 right-0 w-full cursor-pointer h-0 group group-hover:h-full ease-in duration-300 rounded-lg bg-black opacity-70">
                                <svg class="play-b hidden group-hover:block"></svg>
                            </figure>
                            <div class="absolute bottom-0 w-full z-50">
                                <div class="flex flex-row w-full gap-2 p-2 items-center  bg-black opacity-60">
                                    <span class="fm:hidden">
                                        <svg xmlns="http://www.w3.org/2000/svg" version="1.1" width="44" height="18" viewBox="0 0 64 32"><g fill="#e80056"><rect x="0" y="0" width="100%" height="100%" rx="4"></rect></g><g transform="translate(8.000000, 7.000000)" fill="#000000" fill-rule="nonzero"><polygon points="0 18 5 18 5 0 0 0"></polygon><path d="M15.6725178,0 L14.5534833,8.40846934 L13.8582008,3.83502426 C13.65661,2.37009263 13.4632474,1.09175121 13.278113,0 L7,0 L7,18 L11.2416347,18 L11.2580911,6.11380679 L13.0436094,18 L16.0633571,18 L17.7583653,5.8517865 L17.7707076,18 L22,18 L22,0 L15.6725178,0 Z"></path><path d="M24,18 L24,0 L31.8045586,0 C33.5693522,0 35,1.41994415 35,3.17660424 L35,14.8233958 C35,16.5777858 33.5716617,18 31.8045586,18 L24,18 Z M29.8322479,3.2395236 C29.6339219,3.13233348 29.2545158,3.08072342 28.7026524,3.08072342 L28.7026524,14.8914865 C29.4312846,14.8914865 29.8796736,14.7604764 30.0478195,14.4865461 C30.2159654,14.2165858 30.3021941,13.486105 30.3021941,12.2871637 L30.3021941,5.3078959 C30.3021941,4.49404499 30.272014,3.97397442 30.2159654,3.74371416 C30.1599168,3.5134539 30.0348852,3.34671372 29.8322479,3.2395236 Z"></path><path d="M44.4299079,4.50685823 L44.749518,4.50685823 C46.5447098,4.50685823 48,5.91267586 48,7.64486762 L48,14.8619906 C48,16.5950653 46.5451816,18 44.749518,18 L44.4299079,18 C43.3314617,18 42.3602746,17.4736618 41.7718697,16.6682739 L41.4838962,17.7687785 L37,17.7687785 L37,0 L41.7843263,0 L41.7843263,5.78053556 C42.4024982,5.01015739 43.3551514,4.50685823 44.4299079,4.50685823 Z M43.4055679,13.2842155 L43.4055679,9.01907814 C43.4055679,8.31433946 43.3603268,7.85185468 43.2660746,7.63896485 C43.1718224,7.42607505 42.7955881,7.2893916 42.5316822,7.2893916 C42.267776,7.2893916 41.8607934,7.40047379 41.7816216,7.58767002 L41.7816216,9.01907814 L41.7816216,13.4207851 L41.7816216,14.8074788 C41.8721037,15.0130276 42.2602358,15.1274059 42.5316822,15.1274059 C42.8031285,15.1274059 43.1982131,15.0166981 43.281155,14.8074788 C43.3640968,14.5982595 43.4055679,14.0880581 43.4055679,13.2842155 Z"></path></g></svg>
                                    </span>
                                    <span class="fd:hidden">
                                        <svg xmlns="http://www.w3.org/2000/svg" version="1.1" width="35" height="14" viewBox="0 0 64 32"><g fill="#e80056"><rect x="0" y="0" width="100%" height="100%" rx="4"></rect></g><g transform="translate(8.000000, 7.000000)" fill="#000000" fill-rule="nonzero"><polygon points="0 18 5 18 5 0 0 0"></polygon><path d="M15.6725178,0 L14.5534833,8.40846934 L13.8582008,3.83502426 C13.65661,2.37009263 13.4632474,1.09175121 13.278113,0 L7,0 L7,18 L11.2416347,18 L11.2580911,6.11380679 L13.0436094,18 L16.0633571,18 L17.7583653,5.8517865 L17.7707076,18 L22,18 L22,0 L15.6725178,0 Z"></path><path d="M24,18 L24,0 L31.8045586,0 C33.5693522,0 35,1.41994415 35,3.17660424 L35,14.8233958 C35,16.5777858 33.5716617,18 31.8045586,18 L24,18 Z M29.8322479,3.2395236 C29.6339219,3.13233348 29.2545158,3.08072342 28.7026524,3.08072342 L28.7026524,14.8914865 C29.4312846,14.8914865 29.8796736,14.7604764 30.0478195,14.4865461 C30.2159654,14.2165858 30.3021941,13.486105 30.3021941,12.2871637 L30.3021941,5.3078959 C30.3021941,4.49404499 30.272014,3.97397442 30.2159654,3.74371416 C30.1599168,3.5134539 30.0348852,3.34671372 29.8322479,3.2395236 Z"></path><path d="M44.4299079,4.50685823 L44.749518,4.50685823 C46.5447098,4.50685823 48,5.91267586 48,7.64486762 L48,14.8619906 C48,16.5950653 46.5451816,18 44.749518,18 L44.4299079,18 C43.3314617,18 42.3602746,17.4736618 41.7718697,16.6682739 L41.4838962,17.7687785 L37,17.7687785 L37,0 L41.7843263,0 L41.7843263,5.78053556 C42.4024982,5.01015739 43.3551514,4.50685823 44.4299079,4.50685823 Z M43.4055679,13.2842155 L43.4055679,9.01907814 C43.4055679,8.31433946 43.3603268,7.85185468 43.2660746,7.63896485 C43.1718224,7.42607505 42.7955881,7.2893916 42.5316822,7.2893916 C42.267776,7.2893916 41.8607934,7.40047379 41.7816216,7.58767002 L41.7816216,9.01907814 L41.7816216,13.4207851 L41.7816216,14.8074788 C41.8721037,15.0130276 42.2602358,15.1274059 42.5316822,15.1274059 C42.8031285,15.1274059 43.1982131,15.0166981 43.281155,14.8074788 C43.3640968,14.5982595 43.4055679,14.0880581 43.4055679,13.2842155 Z"></path></g></svg>
                                    </span>
                                    <span class="rem--7 text-gray-200 !font-extrabold">{{movie.imdb_number}}/10</span>
                                </div>
                                <div class="bg-black opacity-60 w-full text-center">
                                    <span class="rem--7 text-gray-200 !font-extrabold">{{movie.title}}</span>
                                </div>
                            </div>
                        </router-link>
                    </div>
                </div>
                <div class="text-center mt-5">
                    <Button my_class="w-[12rem]" text="مشاهده بیشتر" @click="getData(genre,(take+=12))"></Button>
                </div>
            </div>
            <Loading :loading="loading"></Loading>
    </div>
</template>

<script>
    import Owl from '@/components/Owl'
    import Button from '@/components/Button'
    import Loading from '@/components/Loading'
    import axios from "../plugins/axios";
    export default{
        name:'Bheader',
        components:{Owl,Button,Loading},
        props:["sliders","genres"],
        data(){
            return{
                api:process.env.VUE_APP_API+'/api/',
                url:process.env.VUE_APP_API,
                genreSwitch:'movie',
                movies:[],
                loading:false,
                genre:'all',
                take:12
            }
        },
        mounted(){
            this.getData(this.genre)
        },
        methods:{
            async getData(genre,take=this.take){
                this.genre = genre;
                this.take = take;
                this.loading = true;
                await axios.get(`${this.api}genre/${genre}/${this.genreSwitch}/${this.take}`).then(resp=>{
                    this.movies = resp.data.data;
                })
                this.loading = false;
            }
        }
    }
</script>